ЕРПУХАстенд.cbr_Основной/src/Catalogs/РесурсныеСпецификации/РесурсныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ee5a63d2-90be-4f36-8a88-5415230abebc">
  <name>РесурсныеСпецификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="c0db759b-cb86-470f-ac1a-4622007748c9">
    <name>КонецДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="27f7b7ba-b394-47b5-89a1-f5441072f5d4">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="436cac62-4694-43a2-8d22-669228b1baf1">
    <name>ОсновноеИзделиеКоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>cbr_Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Действия</name>
    <comment>// Османов Н.М. 21.11.2023 ЧТЗ №Действия в производстве</comment>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Стадия</name>
      <type>
        <types>CatalogRef.СтадииЗагрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Температура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Давление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f3f60468-b96f-4528-8adc-5b0b567a3e3d">
    <name>МатериалыИУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c760a5ad-a536-49ec-816d-fad0d87140f3">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/РесурсныеСпецификации/Forms/ФормаЭлемента/Module.bsl
//++ ШмелевР
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура cbr_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Отказ = РаботаСПроизводствомСервер.УстановленЗапретОткрытияСпецификации(Объект);
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru='Установлен запрет на просмотр ресурсной спецификации'");
		ТекстСообщения = СтрШаблон(ТекстСообщения);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура cbr_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФорму();	
	
КонецПроцедуры

&НаКлиенте
Процедура cbr_ПриОткрытииПосле(Отказ)
	
	ИтогПодвалаВремяДействий = Объект.Действия.Итог("Время");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура cbr_АктивностьПриИзмененииПодключаемый(Команда) Экспорт
	 
	Если Не Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыСпецификаций.Действует") Тогда
		Возврат;
	КонецЕсли;
	
	УжеАктивнаяСпецификация = АктивнаяСпецификация();
	
	Если Не Объект.cbr_Активность Тогда
		Если Не ЗначениеЗаполнено(УжеАктивнаяСпецификация) Тогда
			ТекстСообщения = НСтр("ru='Внимание! При снятом флажке ""Активная"" не остаётся ни одной действующей активной ресурсной спецификации!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(УжеАктивнаяСпецификация) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Уже существует действующая ресурсная спецификация со статусом ""Активная"": %1. В ней будет снят флажок активности. Продолжить?'");
	ТекстВопроса = СтрШаблон(ТекстВопроса, УжеАктивнаяСпецификация);
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.cbr_Активность = Ложь;
		Возврат;
	КонецЕсли;
	
	ИзменитьАктивностьРесурснойСпецификации(УжеАктивнаяСпецификация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДействия

&НаКлиенте
Процедура ДействияНоменклатураХарактеристикаУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ТаблицаВыбора", ТаблицаОбеспеченияВХранилище());
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборСтрокиДляПодстановки", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.РесурсныеСпецификации.Форма.ВыборНоменклатуры", ПараметрыОткрытия, , , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Не Поле.Имя = "ТаблицаДействийНоменклатура"
		И Не Поле.Имя = "ТаблицаДействийХарактеристика" 
		И Не Поле.Имя = "ТаблицаДействийУпаковка" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ТаблицаВыбора", ТаблицаОбеспеченияВХранилище());
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыборСтрокиДляПодстановки", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.РесурсныеСпецификации.Форма.ВыборНоменклатуры", ПараметрыОткрытия, , , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриИзменении(Элемент)
	
	ИтогПодвалаВремяДействий = Объект.Действия.Итог("Время");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборСтрокиДляПодстановки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ТаблицаДействий.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Результат);
	
	ТаблицаПоОтбору = Объект.МатериалыИУслуги.НайтиСтроки(Результат);
	
	ИтогоКоличество = 0;
	Для Каждого СтрокаТаблицыПоОтбору Из ТаблицаПоОтбору Цикл
		ИтогоКоличество = ИтогоКоличество + СтрокаТаблицыПоОтбору.КоличествоУпаковок;
	КонецЦикла;
	
	Если ИтогоКоличество > 0 Тогда
		ИтогоКоличествоВДействиях = 0;
		ТаблицаПоОтбору = Объект.Действия.НайтиСтроки(Результат);
		Для Каждого СтрокаДействий Из ТаблицаПоОтбору Цикл
			ИтогоКоличествоВДействиях = ИтогоКоличествоВДействиях + СтрокаДействий.КоличествоУпаковок;
		КонецЦикла;
	КонецЕсли;
	
	Если ИтогоКоличество <> ИтогоКоличествоВДействиях Тогда
		Разница = ИтогоКоличествоВДействиях - ИтогоКоличество;
		ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок - Разница;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Процедура ПодготовитьФорму()

	Если ФормыУХ.ЭлементыФормыУХУжеСозданы(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаДействия = ФормыУХ.СоздатьГруппуФормы(Элементы, 
												"ГруппаДействия",
												"Действия",
												ВидГруппыФормы.Страница,
												Элементы.Страницы,
												Элементы.ГруппаПроизводственныйПроцесс);
								
	ДанныеПоТаблице = РаботаСФормамиСервер.СоздатьТаблицуНаФорме(Элементы,
																"ТаблицаДействий",
																"Действия",
																"Объект.Действия",
																Элементы.ГруппаДействия,
																Метаданные.Справочники.РесурсныеСпецификации.ТабличныеЧасти.Действия,
																,
																"");

	ГруппаДействия.ПутьКДаннымЗаголовка = "Объект.Действия.КоличествоСтрок";
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДанныеПоТаблице.Таблица.Подвал = Истина;
	ИтогПодвалаВремяДействий = Новый РеквизитФормы("ИтогПодвалаВремяДействий", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
	ДобавляемыеРеквизиты.Добавить(ИтогПодвалаВремяДействий);
		
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ДанныеПоТаблице.Колонки.Время.ПутьКДаннымПодвала = "ИтогПодвалаВремяДействий";
	
	ДанныеПоТаблице.Таблица.УстановитьДействие("Выбор", "ДействияВыбор");
	ДанныеПоТаблице.Таблица.УстановитьДействие("ПриИзменении", "ДействияПриИзменении");

	ПараметрыГруппыДействияУпаковкаЕдиницИзмерения = Новый Структура("Группировка", ГруппировкаКолонок.ВЯчейке);
	ГруппаДействияУпаковкаЕдиницИзмерения = ФормыУХ.СоздатьГруппуФормы(Элементы, 
												"ГруппаДействияУпаковкаЕдиницИзмерения",
												"Действия единицы измерения",
												ВидГруппыФормы.ГруппаКолонок,
												Элементы.ТаблицаДействий,
												Элементы.ТаблицаДействийКоличествоУпаковок,
												ПараметрыГруппыДействияУпаковкаЕдиницИзмерения);
												
	Элементы.Переместить(ДанныеПоТаблице.Колонки.Упаковка, ГруппаДействияУпаковкаЕдиницИзмерения);
												
	КолонкаНоменклатураЕдиницаИзмерения = ФормыУХ.СоздатьПолеФормы(Элементы,
																"ТаблицаДействийНоменклатураЕдиницаИзмерения",
																"Ед. изм.",
																"Объект.Действия.Номенклатура.ЕдиницаИзмерения",
																ВидПоляФормы.ПолеНадписи,
																ГруппаДействияУпаковкаЕдиницИзмерения);
												
	ДанныеПоТаблице.Колонки.Номенклатура.УстановитьДействие("НачалоВыбора", "ДействияНоменклатураХарактеристикаУпаковкаНачалоВыбора");
	ДанныеПоТаблице.Колонки.Характеристика.УстановитьДействие("НачалоВыбора", "ДействияНоменклатураХарактеристикаУпаковкаНачалоВыбора");
	ДанныеПоТаблице.Колонки.Упаковка.УстановитьДействие("НачалоВыбора", "ДействияНоменклатураХарактеристикаУпаковкаНачалоВыбора");
	
	ДанныеПоТаблице.Колонки.Номенклатура.РедактированиеТекста = Ложь;
	ДанныеПоТаблице.Колонки.Номенклатура.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
	ДанныеПоТаблице.Колонки.Характеристика.РедактированиеТекста = Ложь;
	ДанныеПоТаблице.Колонки.Характеристика.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
	ДанныеПоТаблице.Колонки.Упаковка.РедактированиеТекста = Ложь;
	ДанныеПоТаблице.Колонки.Упаковка.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
	ЭлементПолеАктивность = ФормыУХ.СоздатьПолеФормы(Элементы,
													"ЭлементПолеАктивность",
													,
													"Объект.cbr_Активность",
													ВидПоляФормы.ПолеФлажка,
													Элементы.ГруппаСтатус);
													
	ЭлементПолеАктивность.УстановитьДействие("ПриИзменении", "cbr_АктивностьПриИзмененииПодключаемый");

	ФормыУХ.ЭлементыФормыУХДобавлены(ЭтотОбъект);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, "ТаблицаДействий", "ТолькоПросмотр", НЕ ДоступностьРеквизитов);
	
	ДополнительныеПараметры = НоменклатураСервер.НовыеПараметрыУсловногоОформленияЕдиницИзмерения();
	ДополнительныеПараметры.ИмяПоляЕдиницаИзмерения = "ТаблицаДействийНоменклатураЕдиницаИзмерения";
	ДополнительныеПараметры.ПутьКПолюУпаковка = "Объект.Действия.Упаковка";
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтотОбъект, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
&Вместо("ПолучитьБлокируемыеРеквизитыОбъекта")
Функция cbr_ПолучитьБлокируемыеРеквизитыОбъекта()
	
	Результат = ПродолжитьВызов();
	Результат.Добавить("ТаблицаДействий");
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТаблицаОбеспеченияВХранилище()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Обеспечение.Номенклатура КАК Номенклатура,
		|	Обеспечение.Характеристика КАК Характеристика,
		|	Обеспечение.Упаковка КАК Упаковка,
		|	Обеспечение.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_ОбеспечениеПредварительно
		|ИЗ
		|	&Обеспечение КАК Обеспечение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Действия.Номенклатура КАК Номенклатура,
		|	Действия.Характеристика КАК Характеристика,
		|	Действия.Упаковка КАК Упаковка,
		|	Действия.КоличествоУпаковок КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_ДействияПредварительно
		|ИЗ
		|	&Действия КАК Действия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбеспечениеПредварительно.Номенклатура КАК Номенклатура,
		|	ВТ_ОбеспечениеПредварительно.Характеристика КАК Характеристика,
		|	ВТ_ОбеспечениеПредварительно.Упаковка КАК Упаковка,
		|	СУММА(ВТ_ОбеспечениеПредварительно.КоличествоУпаковок) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Обеспечение
		|ИЗ
		|	ВТ_ОбеспечениеПредварительно КАК ВТ_ОбеспечениеПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОбеспечениеПредварительно.Номенклатура,
		|	ВТ_ОбеспечениеПредварительно.Характеристика,
		|	ВТ_ОбеспечениеПредварительно.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДействияПредварительно.Номенклатура КАК Номенклатура,
		|	ВТ_ДействияПредварительно.Характеристика КАК Характеристика,
		|	ВТ_ДействияПредварительно.Упаковка КАК Упаковка,
		|	СУММА(ВТ_ДействияПредварительно.КоличествоУпаковок) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ ВТ_Действия
		|ИЗ
		|	ВТ_ДействияПредварительно КАК ВТ_ДействияПредварительно
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДействияПредварительно.Номенклатура,
		|	ВТ_ДействияПредварительно.Характеристика,
		|	ВТ_ДействияПредварительно.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Обеспечение.Номенклатура КАК Номенклатура,
		|	ВТ_Обеспечение.Характеристика КАК Характеристика,
		|	ВТ_Обеспечение.Упаковка КАК Упаковка,
		|	ЕСТЬNULL(ВТ_Обеспечение.КоличествоУпаковок, 0) КАК КоличествоОбеспечение,
		|	ЕСТЬNULL(ВТ_Действия.КоличествоУпаковок, 0) КАК КоличествоДействия,
		|	ЕСТЬNULL(ВТ_Обеспечение.КоличествоУпаковок, 0) - ЕСТЬNULL(ВТ_Действия.КоличествоУпаковок, 0) КАК Разница
		|ИЗ
		|	ВТ_Обеспечение КАК ВТ_Обеспечение
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Действия КАК ВТ_Действия
		|		ПО ВТ_Обеспечение.Номенклатура = ВТ_Действия.Номенклатура
		|			И ВТ_Обеспечение.Характеристика = ВТ_Действия.Характеристика
		|			И ВТ_Обеспечение.Упаковка = ВТ_Действия.Упаковка";
	
	Запрос.УстановитьПараметр("Обеспечение", Объект.МатериалыИУслуги.Выгрузить());
	Запрос.УстановитьПараметр("Действия", Объект.Действия.Выгрузить());
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДанных);
	
КонецФункции

&НаСервере
Функция АктивнаяСпецификация()

	Возврат Справочники.РесурсныеСпецификации.АктивнаяСпецификация(Объект);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ИзменитьАктивностьРесурснойСпецификации(РесурснаяСпецификация)
 
	ОбъектСпецификации = РесурснаяСпецификация.ПолучитьОбъект();
	ОбъектСпецификации.cbr_Активность = Ложь;
	ОбъектСпецификации.Записать();

КонецПроцедуры

&НаСервере
&После("ОсновноеИзделиеХарактеристикаПриИзмененииНаСервере")
Процедура cbr_ОсновноеИзделиеХарактеристикаПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ОсновноеИзделиеХарактеристика) Тогда
		ОсновноеИзделиеУпаковка = УправлениеСвойствами.ЗначениеСвойства(Объект.ОсновноеИзделиеХарактеристика, "УпаковкаРеквизитХарактеристики");
		Объект.ОсновноеИзделиеУпаковка = ОсновноеИзделиеУпаковка;
		
		Отбор = Новый Структура("Номенклатура, Характеристика", ОсновноеИзделиеНоменклатура, ОсновноеИзделиеХарактеристика);
		НайденныеСтроки = Объект.ВыходныеИзделия.НайтиСтроки(Отбор);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Упаковка = ОсновноеИзделиеУпаковка;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПроизводственныйПроцессДобавитьНовыйЭтап")
Функция cbr_ПроизводственныйПроцессДобавитьНовыйЭтап(ЭтапОбъект, КэшЭлементов, Коллекция, Параметры)

	#Вставка
	ЭтапОбъект.Наименование = Объект.Наименование;
	#КонецВставки
	
	НоваяСтрока = Коллекция.Добавить();
	НоваяСтрока.Наименование    = ЭтапОбъект.Наименование;
	НоваяСтрока.Номер           = ЭтапОбъект.НомерЭтапа;
	НоваяСтрока.НомерСледующего = ЭтапОбъект.НомерСледующегоЭтапа;
	НоваяСтрока.Ссылка          = ЭтапОбъект.ПолучитьСсылкуНового();
	НоваяСтрока.ВидЭлемента     = РедакторПроизводственногоПроцессаКлиентСервер.ВидЭлементаПоСсылке(НоваяСтрока.Ссылка);

	РедакторПроизводственногоПроцессаКлиентСервер.УстановитьКартинкуЭлемента(НоваяСтрока);

	КэшЭлемента  = ПроизводственныйПроцессКэшЭлементаКонструктор(НоваяСтрока.ВидЭлемента);
	КэшЭлемента.Объект     = ЭтапОбъект;
	КэшЭлемента.Записывать = Истина;
	КэшЭлементов.Вставить(НоваяСтрока.Ссылка, КэшЭлемента);

	Если Параметры.Свойство("СкорректироватьНумерацию") Тогда
		ПроизводственныйПроцессСкорректироватьНумерациюПослеДобавленияЭлемента(КэшЭлементов, Коллекция, ЭтапОбъект.НомерЭтапа);
	КонецЕсли;

	ПроизводственныйПроцессСкорректироватьСчетчикЭлементов(НоваяСтрока.ВидЭлемента, 1);

	Возврат НоваяСтрока.ПолучитьИдентификатор();

КонецФункции

#КонецОбласти
